In [97]:
%pip install -q --upgrade pip
%pip install -q kagglehub[pandas-datasets]
%pip install -q matplotlib
%pip install -q numpy
%pip install -q pandas

Note: you may need to restart the kernel to use updated packages.
Note: you may need to restart the kernel to use updated packages.
Note: you may need to restart the kernel to use updated packages.
Note: you may need to restart the kernel to use updated packages.
Note: you may need to restart the kernel to use updated packages.

In [98]:
import kagglehub
from kagglehub import KaggleDatasetAdapter
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd

In [99]:
# Set the path to the file you'd like to load
file_path = "data_science_job_posts_2025.csv"

# Load the latest version
df = kagglehub.load_dataset(
  KaggleDatasetAdapter.PANDAS,
  "elahehgolrokh/data-science-job-postings-with-salaries-2025",
  file_path,
)

list(df.columns)

C:\Users\USUARIO\AppData\Local\Temp\ipykernel_5020\236363616.py:5: DeprecationWarning: load_dataset is deprecated and will be removed in future version.
  df = kagglehub.load_dataset(

Warning: Looks like you're using an outdated `kagglehub` version (installed: 0.3.11), please consider upgrading to the latest version (0.3.13).

['job_title',
 'seniority_level',
 'status',
 'company',
 'location',
 'post_date',
 'headquarter',
 'industry',
 'ownership',
 'company_size',
 'revenue',
 'salary',
 'skills']

In [112]:
def toInt(nums):
    nums = [n.replace(",", "") for n in nums]
    nums = [int(n.replace("€", "")) for n in nums]
    return nums

def promediate(nums):
    nums = nums.split("-")
    nums = toInt(nums)
    return sum(nums)/len(nums)

copydf = df.copy()
copydf = copydf.drop(columns=["job_title","company","post_date"])
copydf["salary"] = copydf["salary"].apply(promediate)
copydf

,seniority_level,status,location,headquarter,industry,ownership,company_size,revenue,salary,skills
0,senior,hybrid,"Grapevine, TX . Hybrid","Bentonville, AR, US",Retail,Public,€352.44B,Public,150705.0,"['spark', 'r', 'python', 'scala', 'machine lea..."
1,lead,hybrid,"Fort Worth, TX . Hybrid","Detroit, MI, US",Manufacturing,Public,"155,030",€51.10B,118733.0,"['spark', 'r', 'python', 'sql', 'machine learn..."
2,senior,on-site,"Austin, TX . Toronto, Ontario, Canada . Kirkla...","Redwood City, CA, US",Technology,Public,"25,930",€33.80B,127273.0,"['aws', 'git', 'python', 'docker', 'sql', 'mac..."
3,senior,hybrid,"Chicago, IL . Scottsdale, AZ . Austin, TX . Hy...","San Jose, CA, US",Technology,Public,"34,690",€81.71B,153599.5,"['sql', 'r', 'python']"
4,NaN,on-site,On-site,"Stamford, CT, US",Finance,Private,"1,800",Private,171254.5,[]
...,...,...,...,...,...,...,...,...,...,...
939,senior,NaN,"Bengaluru, Karnataka, India","Armonk, NY, US",Technology,Public,"524,598",€120.29B,43184.0,"['pytorch', 'python', 'sql', 'machine learning..."
940,senior,NaN,"Melbourne, Victoria, Australia","Seattle, WA, US",Retail,Public,"865,456",€838.78B,64290.0,"['amazon', 'machine learning']"
941,midlevel,on-site,"McLean, VA","McLean, VA, US",Retail,Public,"55,150",€36.29B,156207.0,"['spark', 'aws', 'r', 'python', 'scala', 'sql'..."
942,midlevel,on-site,"New York, NY","McLean, VA, US",Retail,Public,"55,110",€36.34B,170372.0,"['spark', 'aws', 'r', 'python', 'scala', 'sql'..."
943,senior,on-site,"San Diego, CA","Mountain View, CA, US",Technology,Public,"17,040",€95.22B,198706.0,"['r', 'python', 'scala', 'sql', 'machine learn..."

In [119]:
skills = copydf["skills"]
skills = skills.apply(lambda x: list(x))
skills[0]

['[',
 "'",
 's',
 'p',
 'a',
 'r',
 'k',
 "'",
 ',',
 ' ',
 "'",
 'r',
 "'",
 ',',
 ' ',
 "'",
 'p',
 'y',
 't',
 'h',
 'o',
 'n',
 "'",
 ',',
 ' ',
 "'",
 's',
 'c',
 'a',
 'l',
 'a',
 "'",
 ',',
 ' ',
 "'",
 'm',
 'a',
 'c',
 'h',
 'i',
 'n',
 'e',
 ' ',
 'l',
 'e',
 'a',
 'r',
 'n',
 'i',
 'n',
 'g',
 "'",
 ',',
 ' ',
 "'",
 't',
 'e',
 'n',
 's',
 'o',
 'r',
 'f',
 'l',
 'o',
 'w',
 "'",
 ']']

In [114]:
data = [
    ["a",["1 hey","2 hi","3 hello"]],
    ["b",["1 what","2 how","3 say"]]
]
df = pd.DataFrame(data,columns=["first","second"])
df = df.explode("second")
df

  first   second
0     a    1 hey
0     a     2 hi
0     a  3 hello
1     b   1 what
1     b    2 how
1     b    3 say